laj_api/app/controllers/sticky_notes_controller.rb

  def index
    @sticky_notes = StickyNote.all
---
SELECT "sticky_notes".* FROM "sticky_notes"

  def create
    @sticky_note = StickyNote.new(sticky_note_params.merge(user: current_user))

    if @sticky_note.save
---
INSERT INTO "sticky_notes" ("jobListing_url", "company", "title", "location", "app_status", "notes", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"

  def update
    if @sticky_note.update(sticky_note_params)
---
UPDATE "sticky_notes" SET "jobListing_url" = $1, "company" = $2, "title" = $3, "location" = $4, "app_status" = $5, "notes" = $6, "updated_at" = $7 WHERE "sticky_notes"."id" = $8  [["jobListing_url", "abc"], ["company", "abc"], ["title", "abc"], ["location", "taiwan"], ["app_status", ""], ["notes", ""], ["updated_at", "2018-09-11 21:51:26.116753"], ["id", 9]]

  def destroy
    @sticky_note.destroy
---
DELETE FROM "sticky_notes" WHERE "sticky_notes"."id" = $1  [["id", 10]]

    def set_sticky_note
      @sticky_note = StickyNote.find(params[:id])
---
SELECT  "sticky_notes".* FROM "sticky_notes" WHERE "sticky_notes"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]