laj_api/app/controllers/users_controller.rb

  def create
    @hashMe = BCrypt::Password.create(user_params[:password])
    @user = User.new(
      email: user_params[:email],
      password_digest: @hashMe
    )

    if @user.save
---
INSERT INTO "users" ("email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["email", "c@c.com"], ["password_digest", "cc"], ["created_at", "2018-09-06 19:08:19.948639"], ["updated_at", "2018-09-06 19:08:19.948639"]]
INSERT INTO "users" ("email", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"